node {
  name: "img_inputs"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 112
        }
        dim {
          size: 112
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "img_labels"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "input"
  op: "Identity"
  input: "img_inputs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: false
      }
    }
  }
}
node {
  name: "phase_train"
  op: "PlaceholderWithDefault"
  input: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.06566410511732101
      }
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "MobileFaceNet/Conv2d_0/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "MobileFaceNet/Conv2d_0/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "MobileFaceNet/Conv2d_0/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/weights"
      }
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/weights/Initializer/truncated_normal"
  op: "Add"
  input: "MobileFaceNet/Conv2d_0/weights/Initializer/truncated_normal/mul"
  input: "MobileFaceNet/Conv2d_0/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/weights"
      }
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/weights/Assign"
  op: "Assign"
  input: "MobileFaceNet/Conv2d_0/weights"
  input: "MobileFaceNet/Conv2d_0/weights/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/weights/read"
  op: "Identity"
  input: "MobileFaceNet/Conv2d_0/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/weights"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 4.999999873689376e-05
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "MobileFaceNet/Conv2d_0/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/kernel/Regularizer/l2_regularizer/scale"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/Conv2D"
  op: "Conv2D"
  input: "input"
  input: "MobileFaceNet/Conv2d_0/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/BatchNorm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/BatchNorm/beta/Assign"
  op: "Assign"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/beta"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/BatchNorm/beta/read"
  op: "Identity"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/BatchNorm/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/BatchNorm/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/BatchNorm/gamma/Assign"
  op: "Assign"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/gamma"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/BatchNorm/gamma/read"
  op: "Identity"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/gamma"
      }
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/BatchNorm/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/BatchNorm/moving_mean/Assign"
  op: "Assign"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/moving_mean"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/BatchNorm/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/BatchNorm/moving_variance/Assign"
  op: "Assign"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/moving_variance"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Switch"
  op: "Switch"
  input: "phase_train"
  input: "phase_train"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/switch_t"
  op: "Identity"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/switch_f"
  op: "Identity"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/pred_id"
  op: "Identity"
  input: "phase_train"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Const"
  op: "Const"
  input: "^MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Const_1"
  op: "Const"
  input: "^MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm/Switch:1"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm/Switch_1:1"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm/Switch_2:1"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Const"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.9999999494757503e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm/Switch"
  op: "Switch"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/Conv2D"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/MobileFaceNet/Conv2d_0/Conv2D"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm/Switch_1"
  op: "Switch"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/gamma/read"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/gamma"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm/Switch_2"
  op: "Switch"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/beta/read"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm_1"
  op: "FusedBatchNorm"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm_1/Switch"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm_1/Switch_1"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm_1/Switch_2"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm_1/Switch_3"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm_1/Switch_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.9999999494757503e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm_1/Switch"
  op: "Switch"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/Conv2D"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/MobileFaceNet/Conv2d_0/Conv2D"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm_1/Switch_1"
  op: "Switch"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/gamma/read"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/gamma"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm_1/Switch_2"
  op: "Switch"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/beta/read"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm_1/Switch_3"
  op: "Switch"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/moving_mean/read"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm_1/Switch_4"
  op: "Switch"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/moving_variance/read"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Merge"
  op: "Merge"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm_1"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Merge_1"
  op: "Merge"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm_1:1"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Merge_2"
  op: "Merge"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm_1:2"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/FusedBatchNorm:2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/Switch"
  op: "Switch"
  input: "phase_train"
  input: "phase_train"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/switch_t"
  op: "Identity"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/switch_f"
  op: "Identity"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/pred_id"
  op: "Identity"
  input: "phase_train"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg/decay"
  op: "Const"
  input: "^MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/switch_t"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.004999999888241291
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg/sub"
  op: "Sub"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg/sub/Switch:1"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg/sub/Switch_1:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg/sub/Switch"
  op: "Switch"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/moving_mean/read"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg/sub/Switch_1"
  op: "Switch"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Merge_1"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Merge_1"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg/mul"
  op: "Mul"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg/sub"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg"
  op: "AssignSub"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg/Switch:1"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg/Switch"
  op: "RefSwitch"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/moving_mean"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg_1/decay"
  op: "Const"
  input: "^MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/switch_t"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.004999999888241291
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg_1/sub/Switch:1"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg_1/sub/Switch_1:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg_1/sub/Switch"
  op: "Switch"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/moving_variance/read"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg_1/sub/Switch_1"
  op: "Switch"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Merge_2"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Merge_2"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg_1/sub"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg_1/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg_1"
  op: "AssignSub"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg_1/Switch:1"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg_1/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg_1/Switch"
  op: "RefSwitch"
  input: "MobileFaceNet/Conv2d_0/BatchNorm/moving_variance"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/Identity"
  op: "Identity"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/Identity/Switch:1"
  input: "^MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg"
  input: "^MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/AssignMovingAvg_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/Identity/Switch"
  op: "Switch"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Merge"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Merge"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/Switch_1"
  op: "Switch"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Merge"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond/Merge"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/Merge"
  op: "Merge"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/Switch_1"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/Identity"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.25
      }
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/prelu_alphas"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/prelu_alphas/Assign"
  op: "Assign"
  input: "MobileFaceNet/Conv2d_0/prelu_alphas"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/prelu_alphas"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileFaceNet/Conv2d_0/prelu_alphas/read"
  op: "Identity"
  input: "MobileFaceNet/Conv2d_0/prelu_alphas"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/Conv2d_0/prelu_alphas"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/Relu"
  op: "Relu"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/Merge"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/Abs"
  op: "Abs"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/Merge"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/sub"
  op: "Sub"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/BatchNorm/cond_1/Merge"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/Abs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/mul"
  op: "Mul"
  input: "MobileFaceNet/Conv2d_0/prelu_alphas/read"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/mul_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/mul_1"
  op: "Mul"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/mul"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/mul_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/Conv2d_0/add"
  op: "Add"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/Relu"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/depthwise_weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000@\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/depthwise_weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/depthwise_weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.06666667014360428
      }
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/depthwise_weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "MobileFaceNet/SeparableConv2d/depthwise_weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/depthwise_weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "MobileFaceNet/SeparableConv2d/depthwise_weights/Initializer/truncated_normal/TruncatedNormal"
  input: "MobileFaceNet/SeparableConv2d/depthwise_weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/depthwise_weights"
      }
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/depthwise_weights/Initializer/truncated_normal"
  op: "Add"
  input: "MobileFaceNet/SeparableConv2d/depthwise_weights/Initializer/truncated_normal/mul"
  input: "MobileFaceNet/SeparableConv2d/depthwise_weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/depthwise_weights"
      }
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/depthwise_weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/depthwise_weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/depthwise_weights/Assign"
  op: "Assign"
  input: "MobileFaceNet/SeparableConv2d/depthwise_weights"
  input: "MobileFaceNet/SeparableConv2d/depthwise_weights/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/depthwise_weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/depthwise_weights/read"
  op: "Identity"
  input: "MobileFaceNet/SeparableConv2d/depthwise_weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/depthwise_weights"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/SeparableConv2d/depthwise/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000@\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/SeparableConv2d/depthwise/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/SeparableConv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "MobileFaceNet/MobileFaceNet/Conv2d_0/add"
  input: "MobileFaceNet/SeparableConv2d/depthwise_weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/BatchNorm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/BatchNorm/beta/Assign"
  op: "Assign"
  input: "MobileFaceNet/SeparableConv2d/BatchNorm/beta"
  input: "MobileFaceNet/SeparableConv2d/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/BatchNorm/beta/read"
  op: "Identity"
  input: "MobileFaceNet/SeparableConv2d/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/BatchNorm/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/BatchNorm/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/BatchNorm/gamma/Assign"
  op: "Assign"
  input: "MobileFaceNet/SeparableConv2d/BatchNorm/gamma"
  input: "MobileFaceNet/SeparableConv2d/BatchNorm/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/BatchNorm/gamma/read"
  op: "Identity"
  input: "MobileFaceNet/SeparableConv2d/BatchNorm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/BatchNorm/gamma"
      }
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/BatchNorm/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/BatchNorm/moving_mean/Assign"
  op: "Assign"
  input: "MobileFaceNet/SeparableConv2d/BatchNorm/moving_mean"
  input: "MobileFaceNet/SeparableConv2d/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "MobileFaceNet/SeparableConv2d/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/BatchNorm/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/BatchNorm/moving_variance/Assign"
  op: "Assign"
  input: "MobileFaceNet/SeparableConv2d/BatchNorm/moving_variance"
  input: "MobileFaceNet/SeparableConv2d/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileFaceNet/SeparableConv2d/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "MobileFaceNet/SeparableConv2d/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileFaceNet/SeparableConv2d/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "MobileFaceNet/MobileFaceNet/SeparableConv2d/BatchNorm/cond/Switch"
  op: "Switch"
  input: "phase_train"
  input: "phase_train"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
